# Задача №1

Greeting = "Привет,Мир!"
print(Greeting)

Greeting = "Привет,Мир питона!"
print(Greeting)

a=10
b=20
c=30

print(a, b, c)

# Задача №2

action = int(input("Введите число:"))

print(action +2)

# Задача №3

age_limit = 18
age=int(input("Введите ваш возраст:"))
if age == age_limit:
    print("Доступ разрешен")
if age != age_limit:
    print("Доступ запрещен")